tutorials/pimpleHFDIBFoam/Immersed_Cyl_Static/Cyl_Body_Fitted_New/Embedded_Cyl_Re_20_2D-Mesh5000/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  8                                     |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

convertToMeters 1;

// ------------------------------------------------------------
// "Book-like" 2D mesh (5000 CVs total)
// Domain: x=[0,24], y=[0,4.1], z=[-0.05,0.05]
// Cylinder: D=1 => R=0.5, center=(2,2)
// x=[0,4] split into 3 horizontal bands (y=[0,1],[1,3],[3,4.1])
// Middle band contains an O-grid in square x=[1,3], y=[1,3]
// Downstream x=[4,24] graded in x (fine near x=4 -> coarse near x=24)
// Total cells = 5000 (z has 1 cell)
// ------------------------------------------------------------

vertices
(
    // z = -0.05
    (0   0    -0.05)  // 0
    (1   0    -0.05)  // 1
    (3   0    -0.05)  // 2
    (4   0    -0.05)  // 3
    (24  0    -0.05)  // 4

    (0   1    -0.05)  // 5
    (1   1    -0.05)  // 6
    (3   1    -0.05)  // 7
    (4   1    -0.05)  // 8
    (24  1    -0.05)  // 9

    (0   3    -0.05)  // 10
    (1   3    -0.05)  // 11
    (3   3    -0.05)  // 12
    (4   3    -0.05)  // 13
    (24  3    -0.05)  // 14

    (0   4.1  -0.05)  // 15
    (1   4.1  -0.05)  // 16
    (3   4.1  -0.05)  // 17
    (4   4.1  -0.05)  // 18
    (24  4.1  -0.05)  // 19

    // z = +0.05
    (0   0     0.05)  // 20
    (1   0     0.05)  // 21
    (3   0     0.05)  // 22
    (4   0     0.05)  // 23
    (24  0     0.05)  // 24

    (0   1     0.05)  // 25
    (1   1     0.05)  // 26
    (3   1     0.05)  // 27
    (4   1     0.05)  // 28
    (24  1     0.05)  // 29

    (0   3     0.05)  // 30
    (1   3     0.05)  // 31
    (3   3     0.05)  // 32
    (4   3     0.05)  // 33
    (24  3     0.05)  // 34

    (0   4.1   0.05)  // 35
    (1   4.1   0.05)  // 36
    (3   4.1   0.05)  // 37
    (4   4.1   0.05)  // 38
    (24  4.1   0.05)  // 39

    // Inner diagonal points on cylinder (z=-0.05)
    (1.6464466094  1.6464466094  -0.05) // 40
    (2.3535533906  1.6464466094  -0.05) // 41
    (2.3535533906  2.3535533906  -0.05) // 42
    (1.6464466094  2.3535533906  -0.05) // 43

    // Inner diagonal points on cylinder (z=+0.05)
    (1.6464466094  1.6464466094   0.05) // 44
    (2.3535533906  1.6464466094   0.05) // 45
    (2.3535533906  2.3535533906   0.05) // 46
    (1.6464466094  2.3535533906   0.05) // 47
);

blocks
(
    // -------------------------
    // Bottom band y=[0,1] (Ny=10)
    // softened grading to reduce jump at y=1
    // -------------------------
    hex (0 1 6 5 20 21 26 25)   (10 10 1) simpleGrading (1 2 1)   // x=[0,1]
    hex (1 2 7 6 21 22 27 26)   (20 10 1) simpleGrading (1 2 1)   // x=[1,3]
    hex (2 3 8 7 22 23 28 27)   (10 10 1) simpleGrading (1 2 1)   // x=[3,4]

    // downstream bottom: x=[4,24] Nx reduced to pay for finer O-grid
    hex (3 4 9 8 23 24 29 28)   (67 10 1) simpleGrading (10 2 1)

    // -------------------------
    // Middle band y=[1,3] (Ny=20)
    // -------------------------
    hex (5 6 11 10 25 26 31 30) (10 20 1) simpleGrading (1 1 1)   // x=[0,1]

    // O-grid (4 blocks) in square x=[1,3], y=[1,3]
    // refined radially: Ny 10 -> 14, graded toward cylinder
    hex (6 7 41 40 26 27 45 44)   (20 14 1) simpleGrading (1 0.30 1) // bottom
    hex (7 12 42 41 27 32 46 45)  (20 14 1) simpleGrading (1 0.30 1) // right
    hex (12 11 43 42 32 31 47 46) (20 14 1) simpleGrading (1 0.30 1) // top
    hex (11 6 40 43 31 26 44 47)  (20 14 1) simpleGrading (1 0.30 1) // left

    hex (7 8 13 12 27 28 33 32) (10 20 1) simpleGrading (1 1 1)   // x=[3,4]

    // downstream middle: Nx reduced
    hex (8 9 14 13 28 29 34 33) (67 20 1) simpleGrading (10 1 1)

    // -------------------------
    // Top band y=[3,4.1] (Ny=10)
    // softened grading to reduce jump at y=3
    // -------------------------
    hex (10 11 16 15 30 31 36 35) (10 10 1) simpleGrading (1 0.5 1) // x=[0,1]
    hex (11 12 17 16 31 32 37 36) (20 10 1) simpleGrading (1 0.5 1) // x=[1,3]
    hex (12 13 18 17 32 33 38 37) (10 10 1) simpleGrading (1 0.5 1) // x=[3,4]

    // downstream top: Nx reduced
    hex (13 14 19 18 33 34 39 38) (67 10 1) simpleGrading (10 0.5 1)
);

edges
(
    // Cylinder arcs (z=-0.05)
    arc 40 41 (2.0 1.5 -0.05)
    arc 41 42 (2.5 2.0 -0.05)
    arc 42 43 (2.0 2.5 -0.05)
    arc 43 40 (1.5 2.0 -0.05)

    // Cylinder arcs (z=+0.05)
    arc 44 45 (2.0 1.5 0.05)
    arc 45 46 (2.5 2.0 0.05)
    arc 46 47 (2.0 2.5 0.05)
    arc 47 44 (1.5 2.0 0.05)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 5 25 20)
            (5 10 30 25)
            (10 15 35 30)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (4 9 29 24)
            (9 14 34 29)
            (14 19 39 34)
        );
    }

    bottomWall
    {
        type wall;
        faces
        (
            (0 1 21 20)
            (1 2 22 21)
            (2 3 23 22)
            (3 4 24 23)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (15 16 36 35)
            (16 17 37 36)
            (17 18 38 37)
            (18 19 39 38)
        );
    }

    cylinderWall
    {
        type wall;
        faces
        (
            (40 41 45 44)
            (41 42 46 45)
            (42 43 47 46)
            (43 40 44 47)
        );
    }

    frontAndBackPlanes
    {
        type empty;
        faces
        (
            // z=-0.05 faces (one per block)
            (0 1 6 5)
            (1 2 7 6)
            (2 3 8 7)
            (3 4 9 8)

            (5 6 11 10)
            (6 7 41 40)
            (7 12 42 41)
            (12 11 43 42)
            (11 6 40 43)
            (7 8 13 12)
            (8 9 14 13)

            (10 11 16 15)
            (11 12 17 16)
            (12 13 18 17)
            (13 14 19 18)

            // z=+0.05 faces (one per block)
            (20 21 26 25)
            (21 22 27 26)
            (22 23 28 27)
            (23 24 29 28)

            (25 26 31 30)
            (26 27 45 44)
            (27 32 46 45)
            (32 31 47 46)
            (31 26 44 47)
            (27 28 33 32)
            (28 29 34 33)

            (30 31 36 35)
            (31 32 37 36)
            (32 33 38 37)
            (33 34 39 38)
        );
    }
);

mergePatchPairs();
